Autodesk.Revit.UI.UIPlumbingUtils.PrepareDataForPipeEditor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double)
Prepare data for pipe editor.
typeId:
The pipe type id.
systemTypeId:
The system type id.
diameter:
The pipe size, the value is a pre-defined list in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017.2

Autodesk.Revit.UI.UIPlumbingUtils
General UI utility methods in Revit UI.
Since:
2017.2